app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."user_id" = 3 ORDER BY starts_at
---
  def index
    @events = Event.where(:user_id => current_user.id)

SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
SELECT "workouts".* FROM "workouts" WHERE "workouts"."event_id" = 1 LIMIT 1
---
  def show
    @event = Event.find(params[:id])

    @workout = Workout.where(:event_id => @event.id ).first

SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
---
  def edit
    @event = Event.find(params[:id])

INSERT INTO "events" ("ends_at", "weight", "rounds", "user_id", "starts_at", "created_at", "all_day", "description", "updated_at", "title") VALUES ('2011-05-22 00:00:01.000000', NULL, NULL, 1, '2011-05-21 00:00:00.000000', '2011-05-31 18:13:10.174206', 't', 'testing on the 21st', '2011-05-31 18:13:10.174206', 'on the 21st')
---
  def create
    @event = Event.new(params[:event])
    @event.user_id = current_user.id
    @start_date = DateTime.civil(@event.starts_at.year, @event.starts_at.month, @event.starts_at.day, 14, 14, 14)
    @end_date = DateTime.civil(@event.starts_at.year, @event.starts_at.month, @event.starts_at.day, 14, 14, 15)
    @event.starts_at = @start_date
    @event.ends_at = @end_date
    @event.all_day = true
    respond_to do |format|
      if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
DELETE FROM "events" WHERE "events"."id" = 1
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy