app/controllers/templates_controller.rb

SELECT "templates".* FROM "templates" WHERE "templates"."user_id" = 1
---
  def index
    @templates = Template.where(:user_id => current_user.id)

SELECT "templates".* FROM "templates" WHERE "templates"."id" = 1 LIMIT 1
---
  def show
    @template = Template.find(params[:id])

INSERT INTO "templates" ("description", "updated_at", "user_id", "created_at", "name") VALUES ('', '2011-05-31 00:31:48.246212', 1, '2011-05-31 00:31:48.246212', 'Fran')
---
  def create
    @template = Template.new(params[:template])

    respond_to do |format|
      if @template.save