app/controllers/workouts_controller.rb

  def index
    @workouts = Workout.all
---
SELECT "workouts".* FROM "workouts"

  def show
    @workout = Workout.find(params[:id])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = 1 LIMIT 1

  def new
    @workout = Workout.new
    # fetches all the crossfit templates ordered by name
    @templates = Template.where(:user_id => User.find_by_name("Crossfit").id).order(:name)
---
SELECT "templates".* FROM "templates" WHERE "templates"."user_id" = 1 ORDER BY name

  def edit
    @workout = Workout.find(params[:id])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = 1 LIMIT 1

  def create
    @workout = Workout.new(params[:workout])
    if @workout.template_id != nil
      @template = Template.find(@workout.template_id)
      if @template.name != "Custom"
        @workout.attributes = { :name => @template.name,
          :description => @template.description }
        @workout.save
        @exercises = @template.exercises
        @exercises.each do |exercise|
          @temp = @workout.exercises.create(:name => exercise.name,
                                    :reps => exercise.reps,
                                    :weight => exercise.weight )
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = 1 LIMIT 1
INSERT INTO "workouts" ("updated_at", "name", "description", "template_id", "entry_id", "created_at", "event_id") VALUES ('2011-05-31 18:14:59.254531', 'Fran', '', 1, NULL, '2011-05-31 18:14:59.254531', 22)
SELECT "exercises".* FROM "exercises" WHERE ("exercises".exerciseable_id = 1 AND "exercises".exerciseable_type = 'Template')
INSERT INTO "exercises" ("weight", "created_at", "name", "reps", "exerciseable_type", "updated_at", "exerciseable_id") VALUES (NULL, '2011-05-31 17:32:57.409793', 'Pushups', 100, 'Workout', '2011-05-31 17:32:57.409793', 4)

  def update
    @workout = Workout.find(params[:id])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = 1 LIMIT 1